; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-30)
(:domain gripper-strips)
(:objects rooma roomb left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 ball30 )
(:init
(room rooma)
(room roomb)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(ball ball28)
(ball ball29)
(ball ball30)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
(at ball12 rooma)
(at ball13 rooma)
(at ball14 rooma)
(at ball15 rooma)
(at ball16 rooma)
(at ball17 rooma)
(at ball18 rooma)
(at ball19 rooma)
(at ball20 roomb)
(at ball21 roomb)
(at ball22 roomb)
(at ball23 roomb)
(at ball24 roomb)
(at ball25 roomb)
(at ball26 roomb)
(at ball27 roomb)
(at ball28 roomb)
(at ball29 roomb)
(at ball30 roomb)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 roomb)
(at ball16 roomb)
(at ball17 roomb)
(at ball18 roomb)
(at ball19 roomb)
(at ball20 roomb)
(at ball21 roomb)
(at ball22 roomb)
(at ball23 roomb)
(at ball24 roomb)
(at ball25 roomb)
(at ball26 roomb)
(at ball27 roomb)
(at ball28 roomb)
(at ball29 roomb)
(at ball30 roomb)
)
)
)

; plan
1. (pick ball19 rooma left)
   deleted: (at ball19 rooma) (free left)
   added: (carry ball19 left)
   goals met: 22 of 30
2. (pick ball18 rooma right)
   deleted: (at ball18 rooma) (free right)
   added: (carry ball18 right)
   goals met: 22 of 30
3. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 22 of 30
4. (drop ball18 roomb right)
   deleted: (carry ball18 right)
   added: (at ball18 roomb) (free right)
   goals met: 23 of 30
5. (drop ball19 roomb left)
   deleted: (carry ball19 left)
   added: (at ball19 roomb) (free left)
   goals met: 24 of 30
6. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 24 of 30
7. (pick ball17 rooma left)
   deleted: (at ball17 rooma) (free left)
   added: (carry ball17 left)
   goals met: 24 of 30
8. (pick ball16 rooma right)
   deleted: (at ball16 rooma) (free right)
   added: (carry ball16 right)
   goals met: 24 of 30
9. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 24 of 30
10. (drop ball16 roomb right)
   deleted: (carry ball16 right)
   added: (at ball16 roomb) (free right)
   goals met: 25 of 30
11. (drop ball17 roomb left)
   deleted: (carry ball17 left)
   added: (at ball17 roomb) (free left)
   goals met: 26 of 30
12. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 26 of 30
13. (pick ball15 rooma left)
   deleted: (at ball15 rooma) (free left)
   added: (carry ball15 left)
   goals met: 26 of 30
14. (pick ball14 rooma right)
   deleted: (at ball14 rooma) (free right)
   added: (carry ball14 right)
   goals met: 26 of 30
15. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 26 of 30
16. (drop ball14 roomb right)
   deleted: (carry ball14 right)
   added: (at ball14 roomb) (free right)
   goals met: 27 of 30
17. (drop ball15 roomb left)
   deleted: (carry ball15 left)
   added: (at ball15 roomb) (free left)
   goals met: 28 of 30
18. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 28 of 30
19. (pick ball13 rooma left)
   deleted: (at ball13 rooma) (free left)
   added: (carry ball13 left)
   goals met: 28 of 30
20. (pick ball12 rooma right)
   deleted: (at ball12 rooma) (free right)
   added: (carry ball12 right)
   goals met: 28 of 30
21. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 28 of 30
22. (drop ball13 roomb left)
   deleted: (carry ball13 left)
   added: (at ball13 roomb) (free left)
   goals met: 29 of 30
23. (drop ball12 roomb right)
   deleted: (carry ball12 right)
   added: (at ball12 roomb) (free right)
   goals met: 30 of 30
